<center>
    <a href='selecting.ipynb'> << Previous</a> &nbsp; | &nbsp; 
    <a href='main.ipynb'>Table of contents</a> &nbsp; | &nbsp; 
    <a href='renaming.ipynb'>Next >></a>
</center>

# 7. Combining two or more Series

`import pandas as pd`

In [1]:
import pandas as pd

`df = pd.read_csv('data/ufo.csv')
df`

In [2]:
df = pd.read_csv('data/ufo.csv')
df

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

Two or more Series can be combined by calling the Series objects and concatenating them with the "+" sign.  
In this case, a coma and a space after it (", ") have been used to separate the values, otherwise they would be shown all togheter as a single string.  

`location = df.City + ", " + df.State`  
`location`

In [6]:
location = df.City + ", " + df.State
location

0                      Ithaca, NY
1                 Willingboro, NJ
2                     Holyoke, CO
3                     Abilene, KS
4        New York Worlds Fair, NY
                   ...
18236              Grant Park, IL
18237             Spirit Lake, IA
18238             Eagle River, WI
18239             Eagle River, WI
18240                    Ybor, FL
Length: 18241, dtype: object

After concatenating the Series objects and saving the result in a variable, we can create a new column in the original DataFrame and assign the concatenated Series to it.  

`df['Location'] = location`  
`df.head()`

In [7]:
df['Location'] = location

In [8]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [10]:
df[['Location','Colors Reported','Shape Reported','Time']]

,Location,Colors Reported,Shape Reported,Time
0,"Ithaca, NY",NaN,TRIANGLE,6/1/1930 22:00
1,"Willingboro, NJ",NaN,OTHER,6/30/1930 20:00
2,"Holyoke, CO",NaN,OVAL,2/15/1931 14:00
3,"Abilene, KS",NaN,DISK,6/1/1931 13:00
4,"New York Worlds Fair, NY",NaN,LIGHT,4/18/1933 19:00
...,...,...,...,...
18236,"Grant Park, IL",NaN,TRIANGLE,12/31/2000 23:00
18237,"Spirit Lake, IA",NaN,DISK,12/31/2000 23:00
18238,"Eagle River, WI",NaN,NaN,12/31/2000 23:45
18239,"Eagle River, WI",RED,LIGHT,12/31/2000 23:45
18240,"Ybor, FL",NaN,OVAL,12/31/2000 23:59

<center>
    <a href='selecting.ipynb'> << Previous</a> &nbsp; | &nbsp; 
    <a href='main.ipynb'>Table of contents</a> &nbsp; | &nbsp; 
    <a href='renaming.ipynb'>Next >></a>
</center>